OPENFOAM/rectangularWingDynamic/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicMesh      yes;
dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver solidBodyMotion;

solidBodyMotionFvMeshCoeffs
{
    motion rotatingMotion;
    origin (0 0 0);
    axis   (0 1 0);
    omega  constant 1;
}